const data = {
  number: { inQuran: 2826, inSurah: 35 },
  meta: {
    juz: 18,
    page: 354,
    manzil: 4,
    ruku: 305,
    hizbQuarter: 142,
    sajda: { recommended: false, obligatory: false }
  },
  text: {
    arab: '۞ اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۚ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ ۖ الْمِصْبَاحُ فِي زُجَاجَةٍ ۖ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ ۚ نُّورٌ عَلَىٰ نُورٍ ۗ يَهْدِي اللَّهُ لِنُورِهِ مَن يَشَاءُ ۚ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ',
    transliteration: {
      en: "Allaahu noorus samaawaati wal ard; masalu noorihee kamishkaatin feehaa misbaah; almisbaahu fee zujaajatin azzujaajatu ka annahaa kawkabun durriyyuny yooqadu min shajaratim mubaarakatin zaitoonatil laa shariqiyyatinw wa laa gharbiyyatiny yakaadu zaituhaa yudeee'u wa law alm tamsashu naar; noorun 'alaa noor; yahdil laahu linoorihee mai yashaaa'; wa yadribul laahul amsaala linnaas; wallaahu bikulli shai'in Aleem"
    }
  },
  translation: {
    en: 'Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly [white] star lit from [the oil of] a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents examples for the people, and Allah is Knowing of all things.',
    id: 'Allah (pemberi) cahaya (kepada) langit dan bumi. Perumpamaan cahaya-Nya, seperti sebuah lubang yang tidak tembus, yang di dalamnya ada pelita besar. Pelita itu di dalam tabung kaca (dan) tabung kaca itu bagaikan bintang yang berkilauan, yang dinyalakan dengan minyak dari pohon yang diberkahi, (yaitu) pohon zaitun yang tumbuh tidak di timur dan tidak pula di barat, yang minyaknya (saja) hampir-hampir menerangi, walaupun tidak disentuh api. Cahaya di atas cahaya (berlapis-lapis), Allah memberi petunjuk kepada cahaya-Nya bagi orang yang Dia kehendaki, dan Allah membuat perumpamaan-perumpamaan bagi manusia. Dan Allah Maha Mengetahui segala sesuatu.'
  },
  audio: {
    primary: 'https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2826',
    secondary: [
      'https://cdn.islamic.network/quran/audio/128/ar.alafasy/2826.mp3',
      'https://cdn.islamic.network/quran/audio/64/ar.alafasy/2826.mp3'
    ]
  },
  tafsir: {
    id: {
      short: 'Allah adalah pemberi cahaya, karenanya Dia menurunkan Al-Qur’an untuk menjadi cahaya bagi kehidupan manusia. Allah adalah pemberi cahaya pada langit dan bumi, baik cahaya material yang kasat mata maupun cahaya immaterial seperti keimanan, pengetahuan, dan lainnya. Perumpamaan kecerlangan cahaya-Nya yang menerangi hati orang-orang mukmin seperti sebuah lubang yang tidak tembus sehingga tidak diterpa angin yang dapat memadamkan cahaya, dan membantu mengumpulkan cahaya lalu memantulkannya; yang di dalamnya ada pelita besar. Pelita itu di dalam tabung kaca dan tabung kaca itu bagaikan bintang yang berkilauan, yang dinyalakan dengan minyak dari pohon yang diberkahi, yaitu pohon zaitun, yang tumbuh tidak di timur dan tidak pula di barat, sehingga pohon itu selalu mendapat sinar matahari sepanjang hari. Kejernihan minyaknya saja hampir-hampir menerangi, walaupun tidak disentuh api. Cahaya di atas cahaya, berlapis-lapis; pelita adalah cahaya, demikian pula kaca dan minyak yang begitu jernih, sehingga sempurnalah sinarnya. Allah memberi petunjuk kepada cahaya-Nya bagi orang yang Dia kehendaki, yaitu siapa saja yang mengikuti petunjuk Al-Qur’an, dan Allah membuat perumpamaan-perumpamaan bagi manusia agar mereka mudah memahami kandungannya dan mengambil pela-jaran darinya hingga akhirnya mau beriman. Dan Allah Maha Mengetahui segala sesuatu; tidak ada sedikit pun yang tersembunyi dari-Nya.',
      long: 'Ayat ini menerangkan bahwa Allah adalah Pemberi cahaya kepada langit dan bumi dan semua yang ada pada keduanya. Dengan cahaya itu segala sesuatu berjalan dengan tertib dan teratur, tak ada yang menyimpang dari jalan yang telah ditentukan baginya, ibarat orang yang berjalan di tengah malam yang gelap gulita dan di tangannya ada sebuah lampu yang terang benderang yang menerangi apa yang ada di sekitarnya. Tentu dia akan aman dalam perjalanannya tidak akan tersesat atau terperosok ke jurang yang dalam, walau bagaimana pun banyak liku-liku yang dilaluinya. Berbeda dengan orang yang tidak mempunyai lampu, tentu akan banyak menemui kesulitan. Meraba-raba kesana kemari berjalan tertegun-tegun karena tidak tahu arah, maka pastilah orang ini akan tersesat atau mendapat kecelakaan karena tidak melihat alam sekitarnya. Amat besarlah faedahnya cahaya yang diberikan Allah kepada alam semesta ini. Cahaya yang dikaruniakan Allah itu bukan sembarang cahaya. Ia adalah cahaya yang istimewa yang tidak ada bandingannya, karena cahaya itu bukan saja menerangi alam lahiriah, tetapi menerangi batiniah. \n' +
        '\n' +
        'Allah memberikan perumpamaan bagi cahaya-Nya dengan sesuatu yang dapat dilihat dan dirasakan oleh manusia pada waktu diturunkannya ayat ini, yaitu dengan cahaya lampu yang dianggap pada masa itu merupakan cahaya yang paling cemerlang. Mungkin bagi kita sekarang ini cahaya lampu itu kurang artinya bila dibandingkan dengan cahaya lampu listrik seribu watt apalagi cahaya yang dapat menembus lapisan-lapisan yang ada di depannya. Sebenarnya cahaya yang menjadi sumber kekuatan bagi alam semesta tidak dapat diserupakan dengan cahaya apa pun yang dapat ditemukan manusia seperti cahaya laser umpamanya. \n' +
        '\n' +
        'Allah memberikan perumpamaan bagi cahaya-Nya dengan cahaya sebuah lampu yang terletak pada suatu tempat di dinding rumah yang sengaja dibuat untuk meletakkan lampu sehingga cahayanya amat terang sekali, berlainan dengan lampu yang diletakkan di tengah rumah, maka cahayanya akan berkurang karena luasnya ruangan yang menyerap cahayanya. Sumbu lampu itu berada dalam kaca yang bersih dan jernih. Kaca itu sendiri sudah cemerlang seperti kristal. Minyaknya diperas dari buah zaitun yang ditanam di atas bukit, selalu disinari cahaya matahari pagi dan petang. Maka pada ayat ini diibaratkan dengan tumbuh-tumbuhan yang tidak tumbuh di timur dan tidak pula di barat, karena kalau pohon itu tumbuh di sebelah timur, mungkin pada sorenya tidak ditimpa cahaya matahari lagi, demikian pula sebaliknya. Minyak lampu itu sendiri karena jernihnya dan baik mutunya hampir-hampir bercahaya, walaupun belum disentuh api, apalagi kalau sudah menyala tentulah cahaya yang ditimbulkannya akan berlipat ganda. \n' +
        '\n' +
        'Di samping cahaya lampu itu sendiri yang amat cemerlang, cahaya itu juga dipantulkan oleh tempat letaknya, maka cahaya yang dipantulkan lampu itu menjadi berlipat ganda. Demikianlah perumpamaan bagi cahaya Allah meskipun amat jauh perbedaan antara cahaya Allah dan cahaya yang dijadikan perumpamaan.\n' +
        '\n' +
        'Allah memberi petunjuk kepada siapa yang dikehendaki-Nya untuk mendapat cahaya itu sehingga dia selalu menempuh jalan yang lurus yang menyampaikannya kepada cita-citanya yang baik dan selalu bertindak bijaksana dalam menghadapi berbagai macam persoalan dalam hidupnya. Berbahagialah orang yang mendapat pancaran Nur Ilahi itu, karena dia telah mempunyai pedoman yang tepat yang tidak akan membawanya kepada hal-hal yang tidak benar dan menyesatkan. Untuk memperoleh Nur Ilahi itu seseorang harus benar-benar beriman dan taat kepada perintah Allah serta menjauhi segala perbuatan maksiat. \n' +
        '\n' +
        "Imam Syafi'i pernah bertanya kepada gurunya yang bernama Waki' tentang hafalannya yang tidak pernah mantap dan cepat lupa, maka gurunya itu menasehatinya supaya ia menjauhi segala perbuatan maksiat, karena ilmu itu adalah Nur Ilahi, dan Nur Ilahi itu tidak akan diberikan kepada orang yang berbuat maksiat. Seperti dalam syair di bawah ini: \n" +
        '\n' +
        "Aku mengadu kepada Waki' tentang buruknya hafalanku, \n" +
        '\n' +
        'Lalu ia menasihatiku agar meninggalkan kemaksiatan.\n' +
        '\n' +
        'Ia memberitahuku bahwa ilmu itu adalah cahaya, \n' +
        '\n' +
        'Dan Cahaya Allah tidak diberikan kepada orang yang berbuat maksiat.\n' +
        '\n' +
        'Yahya bin Salam pernah berkata, "Hati seorang mukmin dapat mengetahui mana yang benar sebelum diterangkan kepadanya, karena hatinya itu selalu sesuai dengan kebenaran." Inilah yang dimaksud dengan sabda Rasulullah saw. \n' +
        '\n' +
        "Berhati-hatilah terhadap firasat orang mukmin, karena ia melihat dengan Nur Allah. (Riwayat al-Bukhari dalam kitab at-Tarikh al-Kabir dari Abu Sa'id al-Khudri)\n" +
        '\n' +
        'Tentu saja yang dimaksud dengan orang mukmin di sini ialah orang-orang yang benar beriman dan bertakwa kepada Allah dengan sepenuhnya.\n' +
        '\n' +
        `Ibnu 'Abbas berkata tentang ayat ini, "Inilah contoh bagi Nur Allah dan petunjuk-Nya yang berada dalam hati orang mukmin. Jika minyak lampu dapat bercahaya sendiri sebelum disentuh api, dan bila disentuh oleh api bertambah cemerlang cahayanya, maka seperti itu pula hati orang mukmin, dia selalu mendapat petunjuk dalam tindakannya sebelum dia diberi ilmu. Apabila dia diberi ilmu, akan bertambahlah keyakinannya, dan bertambah pula cahaya dalam hatinya. Demikianlah Allah memberikan perumpamaan kepada manusia tentang Nur-Nya. Sesungguhnya Dia Maha Mengetahui segala sesuatu."`
    }
  },
  surah: {
    number: 24,
    sequence: 102,
    numberOfVerses: 64,
    name: {
      short: 'النور',
      long: 'سورة النور',
      transliteration: [Object],
      translation: [Object]
    },
    revelation: { arab: 'مدينة', en: 'Medinan', id: 'Madaniyyah' },
    tafsir: {
      id: 'Surat An Nuur terdiri atas 64 ayat, dan termasuk golongan surat-surat Madaniyah. Dinamai An Nuur yang berarti Cahaya, diambil dari kata An Nuur yang terdapat pada ayat ke 35. Dalam ayat ini, Allah s.w.t. menjelaskan tentang Nuur Ilahi, yakni Al Quran yang mengandung petunjuk-petunjuk. Petunjuk-petunjuk Allah itu, merupakan cahaya yang terang benderang menerangi alam semesta. Surat ini sebagian besar isinya memuat petunjuk- petunjuk Allah yang berhubungan dengan soal kemasyarakatan dan rumah tangga.'
    },
    preBismillah: { text: [Object], translation: [Object], audio: [Object] }
  }
}
