{
    "jokes": [
        {"id": 1, "joke": "Kenapa ayam ke sekolah? Karena ingin jadi ayam pintar."},
        {"id": 2, "joke": "Kenapa komputer selalu minum kopi? Karena ingin tidak ada byte lagi."},
        {"id": 3, "joke": "Kenapa pohon pisang tidak pernah kesepian? Karena selalu ada a bunch."},
        {"id": 4, "joke": "Kenapa robot pergi ke sekolah? Karena ingin belajar bahasa pemrograman."},
        {"id": 5, "joke": "Kenapa buku tidak pernah bosan? Karena selalu memiliki banyak halaman untuk dibuka."},
        {"id": 6, "joke": "Kenapa pensil selalu lelah? Karena selalu dipaksa untuk terus menulis."},
        {"id": 7, "joke": "Kenapa lampu lalu lintas merah? Karena selalu harus berhenti."},
        {"id": 8, "joke": "Kenapa sepatu selalu berpasangan? Karena tidak ingin berjalan sendirian."},
        {"id": 9, "joke": "Kenapa kertas selalu datar? Karena tidak ingin disebut kertas keriput."},
        {"id": 10, "joke": "Kenapa bumi bulat? Karena tidak ingin disebut bumi kotak."},
        {"id": 11, "joke": "Kenapa matahari selalu bersinar? Karena tidak ingin disebut matahari malas."},
        {"id": 12, "joke": "Kenapa air selalu basah? Karena tidak ingin disebut air kering."},
        {"id": 13, "joke": "Kenapa bunga selalu berwarna-warni? Karena tidak ingin disebut bunga hitam putih."},
        {"id": 14, "joke": "Kenapa burung selalu bernyanyi? Karena tidak ingin disebut burung bisu."},
        {"id": 15, "joke": "Kenapa kucing selalu mengeong? Karena tidak ingin disebut kucing bisu."},
        {"id": 16, "joke": "Kenapa anjing selalu menggonggong? Karena tidak ingin disebut anjing bisu."},
        {"id": 17, "joke": "Kenapa sapi selalu menguak? Karena tidak ingin disebut sapi bisu."},
        {"id": 18, "joke": "Kenapa kuda selalu meringkik? Karena tidak ingin disebut kuda bisu."},
        {"id": 19, "joke": "Kenapa bebek selalu berkuak? Karena tidak ingin disebut bebek bisu."},
        {"id": 20, "joke": "Kenapa ikan selalu berenang? Karena tidak ingin disebut ikan kering."},
        {"id": 21, "joke": "Kenapa padi selalu hijau? Karena tidak ingin disebut padi kuning."},
        {"id": 22, "joke": "Kenapa rumput selalu tumbuh? Karena tidak ingin disebut rumput mati."},
        {"id": 23, "joke": "Kenapa angin selalu berhembus? Karena tidak ingin disebut angin mati."},
        {"id": 24, "joke": "Kenapa awan selalu bergerak? Karena tidak ingin disebut awan malas."},
        {"id": 25, "joke": "Kenapa hujan selalu turun? Karena tidak ingin disebut hujan naik."},
        {"id": 26, "joke": "Kenapa gunung selalu tinggi? Karena tidak ingin disebut gunung rendah."},
        {"id": 27, "joke": "Kenapa sungai selalu mengalir? Karena tidak ingin disebut sungai mati."},
        {"id": 28, "joke": "Kenapa laut selalu asin? Karena tidak ingin disebut laut tawar."},
        {"id": 29, "joke": "Kenapa langit selalu biru? Karena tidak ingin disebut langit hitam."},
        {"id": 30, "joke": "Kenapa bintang selalu berkelip? Karena tidak ingin disebut bintang mati."}
    ]
}
